# Terminal
cask "ghostty"

# Shell
brew "bash"
brew "bash-completion@2"
brew "fzf"
brew "starship"
brew "zoxide"
brew "mise"

# Editor
brew "neovim"

# Automation
cask "karabiner-elements"
cask "hammerspoon"

# AI
cask "claude-code"

# Python
brew "uv"

# Modern CLI replacements
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "dust"
brew "btop"
brew "git-delta"

# Data + API
brew "jq"
brew "httpie"

# GitHub
brew "gh"

# Other essentials
brew "glow"
brew "lazygit"
brew "midnight-commander"

# Fonts
cask "font-maple-mono-nf"
cask "font-cascadia-code-nf"
